AREA_CODE_MAP = {
    "서울": 1, "인천": 2, "대전": 3, "대구": 4, "광주": 5, "부산": 6, "울산": 7, 
    "세종특별자치시": 8, "경기도": 31, "강원특별자치도": 32, "충청북도": 33, 
    "충청남도": 34, "경상북도": 35, "경상남도": 36, "전북특별자치도": 37, 
    "전라남도": 38, "제주특별자치도": 39
}

SIGUNGU_CODE_MAP = {
    "서울": { "강남구": 1, "강동구": 2, "강북구": 3, "강서구": 4, "관악구": 5, "광진구": 6, "구로구": 7, "금천구": 8, "노원구": 9, "도봉구": 10, "동대문구": 11, "동작구": 12, "마포구": 13, "서대문구": 14, "서초구": 15, "성동구": 16, "성북구": 17, "송파구": 18, "양천구": 19, "영등포구": 20, "용산구": 21, "은평구": 22, "종로구": 23, "중구": 24, "중랑구": 25 },
    "인천": { "강화군": 1, "계양구": 2, "미추홀구": 3, "남동구": 4, "동구": 5, "부평구": 6, "서구": 7, "연수구": 8, "옹진군": 9, "중구": 10 },
    "대전": { "대덕구": 1, "동구": 2, "서구": 3, "유성구": 4, "중구": 5 },
    "대구": { "남구": 1, "달서구": 2, "달성군": 3, "동구": 4, "북구": 5, "서구": 6, "수성구": 7, "중구": 8, "군위군": 9 },
    "광주": { "광산구": 1, "남구": 2, "동구": 3, "북구": 4, "서구": 5 },
    "부산": { "강서구": 1, "금정구": 2, "기장군": 3, "남구": 4, "동구": 5, "동래구": 6, "부산진구": 7, "북구": 8, "사상구": 9, "사하구": 10, "서구": 11, "수영구": 12, "연제구": 13, "영도구": 14, "중구": 15, "해운대구": 16 },
    "울산": { "중구": 1, "남구": 2, "동구": 3, "북구": 4, "울주군": 5 },
    "세종특별자치시": { "세종특별자치시": 1 },
    "경기도": { "가평군": 1, "고양시": 2, "과천시": 3, "광명시": 4, "광주시": 5, "구리시": 6, "군포시": 7, "김포시": 8, "남양주시": 9, "동두천시": 10, "부천시": 11, "성남시": 12, "수원시": 13, "시흥시": 14, "안산시": 15, "안성시": 16, "안양시": 17, "양주시": 18, "양평군": 19, "여주시": 20, "연천군": 21, "오산시": 22, "용인시": 23, "의왕시": 24, "의정부시": 25, "이천시": 26, "파주시": 27, "평택시": 28, "포천시": 29, "하남시": 30, "화성시": 31 },
    "강원특별자치도": { "강릉시": 1, "고성군": 2, "동해시": 3, "삼척시": 4, "속초시": 5, "양구군": 6, "양양군": 7, "영월군": 8, "원주시": 9, "인제군": 10, "정선군": 11, "철원군": 12, "춘천시": 13, "태백시": 14, "평창군": 15, "홍천군": 16, "화천군": 17, "횡성군": 18 },
    "충청북도": { "괴산군": 1, "단양군": 2, "보은군": 3, "영동군": 4, "옥천군": 5, "음성군": 6, "제천시": 7, "증평군": 8, "진천군": 9, "청주시": 10, "충주시": 11 },
    "충청남도": { "계룡시": 1, "공주시": 2, "금산군": 3, "논산시": 4, "당진시": 5, "보령시": 6, "부여군": 7, "서산시": 8, "서천군": 9, "아산시": 10, "예산군": 11, "천안시": 12, "청양군": 13, "태안군": 14, "홍성군": 15 },
    "경상북도": { "경산시": 1, "경주시": 2, "고령군": 3, "구미시": 4, "김천시": 5, "문경시": 6, "봉화군": 7, "상주시": 8, "성주군": 9, "안동시": 10, "영덕군": 11, "영양군": 12, "영주시": 13, "영천시": 14, "예천군": 15, "울릉군": 16, "울진군": 17, "의성군": 18, "청도군": 19, "청송군": 20, "칠곡군": 21, "포항시": 22 },
    "경상남도": { "거제시": 1, "거창군": 2, "고성군": 3, "김해시": 4, "남해군": 5, "밀양시": 6, "사천시": 7, "산청군": 8, "양산시": 9, "의령군": 10, "진주시": 11, "창녕군": 12, "창원시": 13, "통영시": 14, "하동군": 15, "함안군": 16, "함양군": 17, "합천군": 18 },
    "전북특별자치도": { "고창군": 1, "군산시": 2, "김제시": 3, "남원시": 4, "무주군": 5, "부안군": 6, "순창군": 7, "완주군": 8, "익산시": 9, "임실군": 10, "장수군": 11, "전주시": 12, "정읍시": 13, "진안군": 14 },
    "전라남도": { "강진군": 1, "고흥군": 2, "곡성군": 3, "광양시": 4, "구례군": 5, "나주시": 6, "담양군": 7, "목포시": 8, "무안군": 9, "보성군": 10, "순천시": 11, "신안군": 12, "여수시": 13, "영광군": 14, "영암군": 15, "완도군": 16, "장성군": 17, "장흥군": 18, "진도군": 19, "함평군": 20, "해남군": 21, "화순군": 22 },
    "제주특별자치도": { "제주시": 1, "서귀포시": 2 }
}

CATEGORY_TO_ICON_MAP = {
    "도시와지역이벤트": "mask_city",
    "문화예술과공연": "mask_happy",
    "산업과지식": "mask_industry",
    "자연과계절": "mask_nature",
    "전통과역사": "mask_tradition",
    "지역특산물과음식": "mask_food",
    "체험과레저": "mask_sport"
}

NO_IMAGE_URL = "https://placehold.co/300x200?text=No+Image"
PAGE_SIZE = 16
